<?php
if (! defined ( 'IN_GESHAI' )) {
	exit ( 'no direct access allowed' );
}

return array (
		/* 100000 */
		'100000' => '用户名只能为字母或数字组成（且在%s~%s字符之间）',
		'100001' => '请输入正确的邮箱格式',
		'100002' => '请输入密码在%s~%s字符之间',
		'100003' => '请输入确认密码',
		'100004' => '两次密码不一致',
		'100005' => '请输入公司名称%s~%s字符之间',
		'100006' => '公司地址尚未选择完整',
		'100007' => '请输入联系人%s~%s字符之间',
		'100008' => '请输入正确的手机号',
		'100009' => '请输入正确的公司邮箱格式',
		'100010' => '对不起，您将注册的用户名（<strong>%s</strong>）已被注册',
		
		'100011' => '请选择公司行业类别',
		'100012' => '请选择公司性质',
		
		'100013' => '用户名错误或不存在',
		'100014' => '密码错误',
		'100015' => '登陆成功',
		'100016' => '请输入正确的招聘邮箱格式',
		'100017' => '对不起，该企业不存在',
		'100018' => '对不起，你还没有选择联系人',
		'100019' => '对不起，你选择的联系人不可用或已被删除',
		'100020' => '对不起，请输入有效的联系方式:固定电话或手机',
		'100021' => '请输入用户名或邮箱',
		'100022' => '输入邮箱错误或不存在',
		'100023' => '对不起，将要设置的用户名已被占用，请重新输入',
		
		
		'200000' => '地区分类不存在',
		'200001' => '地区分类名称不能为空',
		
		
		'300000' => '对不起，用户参数不合法',
		'300001' => '对不起，用户不存在',
		'300002' => '对不起，当前会话不存在或已过期',
		'300003' => '请输入原密码',
		'300004' => '原密码错误',
		'300005' => '请输入新密码在%s~%s字符之间',
		
		'400000' => '删除logo原文件失败',
		'400001' => '删除营业执照原文件失败',
		'400002' => '数据库',
		
		'500000' => '请输入联系人',
		'500001' => '请输入座机或手机',
);
?>