<?php
if (! defined ( 'IN_PATH' )) {
	exit ( 'no direct access allowed' );
}

/* 时区 */
function inc_timezone() {
	return array (
			0 => array (
					'-12',
					'(标准时-12:00) 日界线西' 
			),
			1 => array (
					'-11',
					'(标准时-11:00) 中途岛、萨摩亚群岛' 
			),
			2 => array (
					'-10',
					'(标准时-10:00) 夏威夷' 
			),
			3 => array (
					'-9',
					'(标准时-9:00) 阿拉斯加' 
			),
			4 => array (
					'-8',
					'(标准时-8:00) 太平洋时间(美国和加拿大)' 
			),
			5 => array (
					'-7',
					'(标准时-7:00) 山地时间(美国和加拿大)' 
			),
			6 => array (
					'-6',
					'(标准时-6:00) 中部时间(美国和加拿大)、墨西哥城' 
			),
			7 => array (
					'-5',
					'(标准时-5:00) 东部时间(美国和加拿大)、波哥大' 
			),
			8 => array (
					'-4',
					'(标准时-4:00) 大西洋时间(加拿大)、加拉加斯' 
			),
			9 => array (
					'-3.5',
					'(标准时-3:30) 纽芬兰' 
			),
			10 => array (
					'-3',
					'(标准时-3:00) 巴西、布宜诺斯艾利斯、乔治敦' 
			),
			11 => array (
					'-2',
					'(标准时-2:00) 中大西洋' 
			),
			12 => array (
					'-1',
					'(标准时-1:00) 亚速尔群岛、佛得角群岛' 
			),
			13 => array (
					'0',
					'(格林尼治标准时) 西欧时间、伦敦、卡萨布兰卡' 
			),
			14 => array (
					'1',
					'(标准时+1:00) 中欧时间、安哥拉、利比亚' 
			),
			15 => array (
					'2',
					'(标准时+2:00) 东欧时间、开罗，雅典' 
			),
			16 => array (
					'3',
					'(标准时+3:00) 巴格达、科威特、莫斯科' 
			),
			17 => array (
					'3.5',
					'(标准时+3:30) 德黑兰' 
			),
			18 => array (
					'4',
					'(标准时+4:00) 阿布扎比、马斯喀特、巴库' 
			),
			19 => array (
					'4.5',
					'(标准时+4:30) 喀布尔' 
			),
			20 => array (
					'5',
					'(标准时+5:00) 叶卡捷琳堡、伊斯兰堡、卡拉奇' 
			),
			21 => array (
					'5.5',
					'(标准时+5:30) 孟买、加尔各答、新德里' 
			),
			22 => array (
					'6',
					'(标准时+6:00) 阿拉木图、 达卡、新亚伯利亚' 
			),
			23 => array (
					'7',
					'(标准时+7:00) 曼谷、河内、雅加达' 
			),
			24 => array (
					'8',
					'(标准时+8:00) 北京、重庆、香港、新加坡' 
			),
			25 => array (
					'9',
					'(标准时+9:00) 东京、汉城、大阪、雅库茨克' 
			),
			26 => array (
					'9.5',
					'(标准时+9:30) 阿德莱德、达尔文' 
			),
			27 => array (
					'10',
					'(标准时+10:00) 悉尼、关岛' 
			),
			28 => array (
					'11',
					'(标准时+11:00) 马加丹、索罗门群岛' 
			),
			29 => array (
					'12',
					'(标准时+12:00) 奥克兰、惠灵顿、堪察加半岛' 
			) 
	);
}
?>