<?php
if (! defined ( 'IN_GESHAI' )) {
	exit ( 'no direct access allowed' );
}

return array (
		'100000' => '请输入正确的邮箱格式',
		'100001' => '请输入密码在%s~%s字符之间',
		'100002' => '请输入确认密码',
		'100003' => '两次密码不一致',
		'100004' => '对不起，此邮箱已被注册',
		'100005' => '已向您的邮箱（%s）发送了一封验证邮件，请在24小时内进行验证。',
		'100006' => '注册成功',
		'100007' => '正在发送邮件...',
		'100008'=>'请求不存在或已过期',
		'100009'=>'对不起，该用户不存在',
		'100010'=>'您已验证此邮箱，无需重复请求',
		'100011'=>'对不起，该邮箱不存在',
		'100012'=>'<p>对不起，当前您已在会话状态。</p><p>若进行其他登陆/注册操作，请先退出/结束当前会话。</p>',
		'100013'=>'<p>对不起，当前您的会话已过期或不存在。</p><p>若进行其他操作，请先登陆或注册。</p>',
		
		'100014' => '用户名错误',
		'100015' => '密码错误',
		'100016' => '登陆成功',
		
		'100017' => '请输入原密码',
		'100018' => '原密码错误',
		'100019' => '请输入新密码在%s~%s字符之间',
		'100020' => '对不起，用户不存在',
		
		'100021' => '请输入昵称在%s~%s字符之间',
		'100022' => '输入个性签名限制在%s内',
		
		'200000' => '地区分类不存在',
		'200001' => '地区分类名称不能为空',
		
		
);
?>