<?php
if (! defined ( 'IN_GESHAI' )) {
	exit ( 'no direct access allowed' );
}

return array (
		'100000' => '行业分类不存在',
		'100001' => '行业分类名称不能为空',
		
		'200000' => '地区分类不存在',
		'200001' => '地区分类名称不能为空',
		
		'300000' => '名称不存在',
		'300001' => '名称不能为空',
		'300002' => '更新封面图片失败，可能操作文件权限不足。',
		'300003' => '删除封面图片失败，可能操作文件权限不足。',
		
		'400000' => '对不起，该资料内容不存在或已被删除',
		'400001' => '请输入标题名称',
		
		'500000' => '分类参数错误或丢失不存在',
		'500001' => '分类不存在或已被删除',
		'500002' => '题库名称不能为空',
		'500003' => '题库参数错误或丢失不存在',
		'500004' => '题库不存在或已被删除',
		
		'600000' => '请输入题目名称',
		'600001' => '题目选项不能为空',
		'600002' => '题目名称过长，请在%s~%s之间',
		'600003' => '对不起，该题目项不存在或已被删除',
		'600004' => '对不起，你所在的用户类型不允许操作',
		'600005' => '对不起，你的答题尚未填写完整，请查看红色边框处！',
		'600006' => '对不起，没有可提交的答题内容！',
		'600007' => '对不起，您已提交过该答题内容，请在24小时后再进行该答题提交！',
		'600008' => '您的答题已成功提交！',
		'600009' => '对不起，答题不存在或已被删除！',
		'600010' => '对不起，该职位尚未添加任何答题内容！',
		'600011' => '对不起，请至少勾选一项作为正确的答案',
		'600012' => '对不起，题库暂无试题内容。',
		'600013' => '对不起，该答题认证信息不存在或已被删除',
		'600014' => '更新图片失败，可能操作文件权限不足。',
		'600015' => '删除图片失败，可能操作文件权限不足。',
		
		'700000' => '请输入学习方案名称',
		'700001' => '对不起，学习方案参数错误或丢失不存在',
		'700002' => '对不起，学习方案不存在或已被删除',
		'700003' => '对不起，该方案项目不存在或已被删除',
		'700004' => '对不起，请输入学习方案项目标题',
		/* synthetic */
		'800000' => '请输入题目名称',
		'800001' => '题目选项不能为空',
		'800002' => '对不起，请至少勾选一项作为正确的答案',
		'800003' => '对不起，该题目项不存在或已被删除',
		'800004' => '更新图片失败，可能操作文件权限不足。',
		'800005' => '删除图片失败，可能操作文件权限不足。',
		
		'900000' => '对不起，职位不存在或已被删除',
		'900001' => '对不起，你已申请过该职位，一周内无法重复申请',
		'900002' => '对不起，你还没有认证该职位，认证后才可以申请该职位。',
		'900003' => '申请已成功发送',
		
		
);
?>