<?php
if (! defined ( 'IN_GESHAI' )) {
	exit ( 'no direct access allowed' );
}

return array (
		'100000' => '请输入姓名',
		'100001' => '对不起，输入姓名不能超过30字符',
		'100002' => '请输入简历名称在%s~%s字符间',
		'100003' => '输入自我介绍在%s字符内',
		'100004' => '请选择期望的行业',
		'100005' => '请选择期望的职位',
		'100006' => '请输入学校名称在%s~%s字符间',
		'100007' => '请输入专业名称在%s~%s字符间',
		'100008' => '请输入专业描述在%s~%s字符间',
		'100009' => '请选择学历',
		'100010' => '对不起，该“教育经历”原信息不存在或已被删除',
		
		'100011' => '请输入培训机构名称在%s~%s字符间',
		'100012' => '请输入培训地点在%s~%s字符间',
		'100013' => '请输入培训课程在%s~%s字符间',
		'100014' => '请输入培训描述在%s~%s字符间',
		'100015' => '对不起，该“培训机构”原信息不存在或已被删除',
		
		'100016' => '请选择语言类别',
		'100017' => '对不起，该“培训语言”原信息不存在或已被删除',
		
		'100018' => '请输入项目名称在%s~%s字符间',
		'100019' => '请输入项目描述在%s~%s字符间',
		'100020' => '请输入项目责任在%s~%s字符间',
		'100021' => '请输入开发工具在%s~%s字符间',
		'100022' => '请输入硬件环境在%s~%s字符间',
		'100023' => '请输入软件环境在%s~%s字符间',
		
		'100024' => '请输入公司名称在%s~%s字符间',
		'100025' => '请选择公司行业',
		'100026' => '请选择公司规模',
		'100027' => '请选择公司性质',
		'100028' => '请输入部门在%s~%s字符间',
		'100029' => '请选择职位',
		'100030' => '输入职位名称不能超出%s字符',
		'100031' => '请输入工作描述在%s~%s字符间',
		'100032' => '请选择工作类型',
		
		'100033' => '请输入附件名称在%s~%s字符间',
		'100034' => '输入附件url地址不能超出%s字符',
		'100035' => '请输入附件描述在%s~%s字符间',
		'100036' => '删除原附件文件失败，可能操作权限不足',
		'100037' => '删除附件文件失败，可能操作权限不足',
		
		'100038' => '请输入主题类型在%s~%s字符间',
		'100039' => '请输入主题描述在%s~%s字符间',
		
		'100040' => '对不起，你还没有创建简历',
		'100041' => '对不起，当前已选择的简历不存在',
		'100042' => '对不起，简历不存在',
		'100043' => '对不起，请选择投递简历',
		
		'100044' => '性别参数错误，请重新选择！',
		'100045' => '请选择出生日期',
		'100046' => '手机号不正确或无效，请重新输入',
		'100047' => '输入邮箱格式错误',
		'100048' => '请选择工作年龄',
		'100049' => '请选择完整的居住地',
		'100050' => '请输入自我介绍',
		'100051' => '请选择完整的工作地点',
		'100052' => '请选择工作性质',
		'100053' => '请选择到岗时间',
		'100054' => '请选择期望薪资类型',
		'100055' => '请选择期望薪资',
		'100056' => '对不起，请先完善简历后才能 申请职位！'
		
);
?>