<?php
if (! defined ( 'IN_GESHAI' )) {
	exit ( 'no direct access allowed' );
}

return array (
		'100000' => '行业分类不存在',
		'100001' => '行业分类名称不能为空',
		
		'200000' => '地区分类不存在',
		'200001' => '地区分类名称不能为空',
		
		'300000' => '名称不存在',
		'300001' => '名称不能为空',
		'300002' => '更新封面图片失败，可能操作文件权限不足。',
		'300003' => '删除封面图片失败，可能操作文件权限不足。',
		
		'400000' => '对不起，该资料内容不存在或已被删除',
		'400001' => '请输入标题名称',
		
		'500000' => '分类参数错误或丢失不存在',
		'500001' => '分类不存在或已被删除',
		'500002' => '题库名称不能为空',
		'500003' => '题库参数错误或丢失不存在',
		'500004' => '题库不存在或已被删除',
		
		'600000' => '请输入题目名称',
		'600001' => '题目选项不能为空',
		'600002' => '题目名称过长，请在%s~%s之间',
		'600003' => '对不起，该题目项不存在或已被删除',
		'600004' => '对不起，你所在的用户类型不允许进入',
		'600005' => '对不起，你的答题尚未填写完整，请查看红色边框处！',
		'600006' => '对不起，没有可提交的答题内容！',
		'600007' => '对不起，您已提交过该答题内容，请在24小时后再进行该答题提交！',
		'600008' => '您的答题已成功提交！',
		'600009' => '对不起，答题不存在或已被删除！',
		'600010' => '对不起，该职位尚未添加任何答题内容！'
		
		
);
?>