<?php
if (! defined ( 'IN_GESHAI' )) {
	exit ( 'no direct access allowed' );
}

return array (
		'100000' => '导航不存在',
		'100001' => '导航名称不能为空',
		
		'200000' => '对不起，请输入大于0的参数值',
		'200001' => '对不起，输入值不能大于20',
		
		'300000' => '请输入要过滤的敏感词',
		'300001' => '请输入选择项名称',
		'300002' => '对不起，类型参数错误或已丢失不存在',
		
		'400000' => '对不起，幻灯内容不存在或已被删除！',
		'400001' => '对不起，分组参数错误或已丢失不存在',
		'400002' => '请输入标题',
		'400003' => '请输入分组名称',
		'400004' => '对不起，删除原图失败，可能无权限操作',
		
		'500000' => '请输入性格类型名称',
		'500001' => '对不起，该性格类型不存在或已被删除'
);
?>